<a href="https://colab.research.google.com/github/BhavikDudhrejiya/Feature-Engineering/blob/main/1_Feaure_Engineering_Analysing_Missing_Values.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
#Importing libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
#Loading data
data = pd.read_csv('https://raw.githubusercontent.com/venky14/Data-Analysis-Project-Titanic/master/titanic_data.csv')

In [4]:
#Checking data
data.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked.
0            1         0       3  ...   7.2500   NaN          S
1            2         1       1  ...  71.2833   C85          C
2            3         1       3  ...   7.9250   NaN          S
3            4         1       1  ...  53.1000  C123          S
4            5         0       3  ...   8.0500   NaN          S

[5 rows x 12 columns]

# Missing data not a random(MNAR)

In [39]:
#Checking missing values
data.isnull().sum()[data.isnull().sum()>0]

Age          177
Cabin        687
Embarked.      2
dtype: int64

In [9]:
#Checking missing values in proportion form
data.isnull().mean()[data.isnull().mean()>0]

Age          0.198653
Cabin        0.771044
Embarked.    0.002245
dtype: float64

In [10]:
#Missing data not a random(MNAR)
data['cabin_null'] = np.where(data['Cabin'].isnull(),1,0)

In [46]:
#Extracing proportion of missing values in cabine data as per the survival
data.groupby(['Survived'])['cabin_null'].mean()
#87% of data are missing in Cabin feature of peoples are not survived
#60% of the data are missing in Cabin feature of a perople are survived

#Anotherway to extract
#data['Survived'][data['Cabin'].isnull()].value_counts()/data['Survived'].value_counts()

Survived
0    0.876138
1    0.602339
Name: cabin_null, dtype: float64

In [51]:
#Extracing proportion of missing values in Age data as per the survival
data['Age'].isnull().groupby(data['Survived']).mean()

#Anotherway to extract
#data['Survived'][data['Age'].isnull()].value_counts()/data['Survived'].value_counts()

Survived
0    0.227687
1    0.152047
Name: Age, dtype: float64

# Missing Data Completely at Random

In [56]:
#Extracing proportion of missing values in Embarked data as per the survival
data['Embarked.'].isnull().mean()

0.002244668911335578

In [57]:
#Extracting the data
data[data['Embarked.'].isnull()]

     PassengerId  Survived  Pclass  ... Cabin Embarked.  cabin_null
61            62         1       1  ...   B28       NaN           0
829          830         1       1  ...   B28       NaN           0

[2 rows x 13 columns]